Repository: BinGess/puzzleGames
Catalog: lib/core/l10n/intl_*.arb
Languages: ar

# appName
source: BrainGym
ar: جيم العقل

source: Start Test
ar: ابدأ الاختبار

source: Play Again
ar: العب مجددًا

# backToDashboard
source: Back to Home
ar: العودة للرئيسية

source: Settings
ar: الإعدادات

source: Analytics
ar: التحليل

source: Profile
ar: ملفي

# lqScore
source: Logic Quotient
ar: مقياس المنطق

# tierBeginner
source: Beginner
ar: مبتدئ

# tierIntermediate
source: Intermediate
ar: متوسط

# tierProfessional
source: Professional
ar: محترف

# tierMaster
source: Master
ar: معلم

# dimensionSpeed
source: Speed
ar: السرعة

# dimensionMemory
source: Memory
ar: الذاكرة

# dimensionSpaceLogic
source: Space & Logic
ar: المنطق والمساحة

# dimensionFocus
source: Focus
ar: التركيز

# dimensionPerception
source: Perception
ar: الإدراك

# gamesSection
source: Games
ar: الألعاب

# personalBest
source: Best
ar: أفضل نتيجة

# latestScore
source: Latest
ar: آخر نتيجة

source: Average
ar: المعدل

# schulteGridName
source: Schulte Grid
ar: شبكة شولت

# schulteGridDesc
source: Tap numbers in order from 1 to max as fast as possible
ar: اضغط الأرقام بالترتيب من ١ إلى الأكبر بأسرع وقت ممكن

# reactionTimeName
source: Reaction Time
ar: وقت التفاعل

# reactionTimeDesc
source: Tap the correct color button based on the font color — not the word meaning
ar: اضغط على اللون الصحيح بناءً على لون الخط — لا على معنى الكلمة

# numberMemoryName
source: Number Memory
ar: ذاكرة الأرقام

# numberMemoryDesc
source: Remember the number sequence and type it back
ar: احفظ الأرقام التي ظهرت ثم أدخلها بنفس الترتيب

# stroopTestName
source: Stroop Test
ar: اختبار ستروب

# stroopTestDesc
source: Tap the button matching the font color, not the word
ar: اضغط على لون الخط، وليس على معنى الكلمة

# visualMemoryName
source: Visual Memory
ar: ذاكرة بصرية

# visualMemoryDesc
source: Remember which squares lit up and tap them
ar: تذكّر المربعات التي أضاءت وحدد مواقعها

# sequenceMemoryName
source: Sequence Memory
ar: تسلسل

# sequenceMemoryDesc
source: Repeat the sequence of lit squares
ar: كرّر التسلسل الذي أضاءت به المربعات

# numberMatrixName
source: Number Matrix
ar: اختبار المصفوفة الرقمية

# numberMatrixDesc
source: Tap numbers 1 through 25 in order as fast as possible
ar: اضغط الأرقام بالترتيب من ١ إلى ٢٥ بأسرع وقت

# reverseMemoryName
source: Reverse Memory
ar: ذاكرة العكس

# reverseMemoryDesc
source: Remember the digits and type them in reverse order
ar: احفظ الأرقام ثم أدخلها بالترتيب المعكوس

# slidingPuzzleName
source: Sliding Puzzle
ar: لغز الأرقام

# slidingPuzzleDesc
source: Sort the number tiles in order with minimum moves
ar: رتّب الأرقام بالترتيب الصحيح بأقل عدد من الحركات

# towerOfHanoiName
source: Tower of Hanoi
ar: برج هانو

# towerOfHanoiDesc
source: Move all discs from the left peg to the right peg
ar: انقل جميع الأقراص من العمود الأيسر إلى الأيمن

source: Tap by font color
ar: اضغط حسب لون الخط

# correctLabel
source: Correct
ar: صحيح

# wrongLabel
source: Wrong
ar: خطأ

# timeLabel
source: Time
ar: الوقت

# movesLabel
source: Moves
ar: الحركات

# lengthLabel
source: Length
ar: الطول

source: Game Over
ar: انتهت اللعبة

source: Congratulations! 🎉
ar: مبروك! 🎉

source: New Record! 🏆
ar: رقم قياسي جديد! 🏆

source: Showing in
ar: يظهر خلال

# tapWhenReady
source: Tap when color appears
ar: اضغط عند ظهور اللون

# enterDigits
source: Enter the digits
ar: أدخل الأرقام

# enterDigitsReverse
source: Enter digits in reverse
ar: أدخل الأرقام معكوسة

# difficultyEasy
source: Easy
ar: سهل

# difficultyMedium
source: Medium
ar: متوسط

# difficultyHard
source: Hard
ar: صعب

# soundEnabled
source: Sound On
ar: الأصوات مفعّلة

# soundDisabled
source: Sound Off
ar: الأصوات معطّلة

# saveImageSuccess
source: Saved to gallery
ar: تم حفظ الصورة في المعرض

# saveImageFailed
source: Failed to save image
ar: تعذر حفظ الصورة

# hapticsEnabled
source: Haptics On
ar: الاهتزاز مفعّل

# hapticsDisabled
source: Haptics Off
ar: الاهتزاز معطّل

# languageLabel
source: Language
ar: اللغة

# fontSizeLabel
source: Font Size
ar: حجم الخط

# fontSizeSmall
source: Small
ar: صغير

# fontSizeMedium
source: Medium
ar: متوسط

# fontSizeLarge
source: Large
ar: كبير

# resetData
source: Reset All Data
ar: إعادة تعيين البيانات

# resetDataConfirm
source: Are you sure? All scores and history will be deleted.
ar: هل أنت متأكد؟ ستُحذف جميع النتائج والسجلات.

# resetDataConfirmButton
source: Yes, Reset
ar: نعم، أعد التعيين

source: Cancel
ar: إلغاء

# aboutApp
source: About
ar: عن التطبيق

# privacyNote
source: All data is stored locally on your device — we collect nothing.
ar: جميع البيانات محفوظة على جهازك فقط — لا نجمع أي معلومات.

source: Version
ar: الإصدار

# seconds
source: s
ar: ثانية

# milliseconds
source: ms
ar: مللي ثانية

source: digits
ar: أرقام

# noDataYet
source: No data yet — play a game first!
ar: لا توجد بيانات بعد — العب أولاً!

source: Recent Sessions
ar: الجلسات الأخيرة

source: All Games
ar: جميع الألعاب

# dashboardTracksReady
source: {played}/{total} tracks ready
ar: {played}/{total} تمارين جاهزة

# featuredMixSemantics
source: Featured mix: {gameName}
ar: المزيج المميز: {gameName}

# featuredMixChip
source: FEATURED MIX
ar: المزيج المميز

# featuredMixTitle
source: Tonight's Cognitive Set
ar: جلسة تدريب اليوم

# featuredMixSubtitle
source: Start with {gameName} and keep the rhythm.
ar: ابدأ بـ {gameName} وادخل الإيقاع.

# featuredMixStart
source: Start Mix
ar: ابدأ الآن

# featuredMixSessions
source: {count} sessions total
ar: {count} جلسة إجمالاً

# featuredContinueTitle
source: Continue
ar: أكمل آخر تدريب

# featuredContinueSubtitle
source: {gameName} · last {score}
ar: {gameName} · آخر نتيجة {score}

# featuredNoHistory
source: No previous session yet
ar: لا يوجد سجل سابق

# featuredRecentTrend
source: Recent trend
ar: اتجاه النتائج مؤخرًا

# trendImproving
source: Improving
ar: يتحسن

# trendDeclining
source: Declining
ar: يتراجع

# trendStable
source: Stable
ar: مستقر

# modeFocus
source: Focus
ar: تركيز

# modeMemory
source: Memory
ar: ذاكرة

# modeSpeed
source: Speed
ar: سرعة

# modeLogic
source: Logic
ar: منطق

# modeChallenge
source: Challenge
ar: تحدي

# dashboardTapToPlay
source: Tap to play
ar: اضغط للعب

# dashboardNewLabel
source: NEW
ar: جديد

# gameCategoryVisualScan
source: Visual Scan
ar: مسح بصري

# gameCategoryReflex
source: Reflex
ar: رد فعل

# gameCategoryMemory
source: Memory
ar: ذاكرة

# gameCategoryFocus
source: Focus
ar: تركيز

# gameCategoryVisualMem
source: Visual Memory
ar: ذاكرة بصرية

# gameCategorySequence
source: Sequence
ar: تسلسل

# gameCategoryCognition
source: Cognition
ar: إدراك

# gameCategoryReverse
source: Reverse
ar: عكسي

# gameCategorySpatial
source: Spatial
ar: مكاني

# gameCategoryStrategy
source: Strategy
ar: استراتيجية

# taglineSchulte
source: Find numbers with steady speed
ar: ابحث عن الأرقام بالتسلسل وبثبات

# taglineReaction
source: React to signal changes instantly
ar: استجب لتغير الإشارة فورًا

# taglineNumberMemory
source: Hold the sequence, replay precisely
ar: احفظ الأرقام ثم أعدها بدقة

# taglineStroop
source: Name the ink, ignore the word
ar: اختر لون الخط وتجاهل الكلمة

# taglineVisual
source: Memorize flashed tiles and recall
ar: تذكر المربعات المضيئة وحددها

# taglineSequence
source: Follow the route without breaking order
ar: اتبع التسلسل دون كسر الترتيب

# taglineMatrix
source: Track positions under moving load
ar: تتبع المواقع تحت ضغط بصري

# taglineReverse
source: Reverse the digits under pressure
ar: أدخل الأرقام بالترتيب العكسي بسرعة

# taglineSliding
source: Slide tiles toward perfect order
ar: حرّك القطع حتى يكتمل الترتيب

# taglineHanoi
source: Plan minimum moves across pegs
ar: خطط لأقل عدد من النقلات
